Revit 2027 API
ParameterTypeId.PlacementCenterX Property
 "Center X"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlacementCenterX { get; }
Public Shared ReadOnly Property PlacementCenterX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlacementCenterX {
	ForgeTypeId^ get ();
}
static member PlacementCenterX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace